# TODO  Напишите функцию count_letters
def count_letters(txt):
    txt = txt.lower()
    let = {}
    spisok = []

    for i in txt:
        if i.isalpha():
            if i not in spisok:
                spisok.append(i)

    for i in spisok:
        let[i] = 0

    for i in let.keys():
        for j in txt:
            if j.isalpha():
                if i == j:
                    let[i] += 1

    return let

# TODO Напишите функцию calculate_frequency
def calculate_frequency(dicti):
    summary = 0
    for i in dicti:
        summary += dicti[i]

    for i in dicti:
        a = dicti[i] / summary
        dicti[i] = a

    for i in dicti:
        print(f'{i}: {dicti[i]:.2f}')

main_str = """
У лукоморья дуб зелёный;
Златая цепь на дубе том:
И днём и ночью кот учёный
Всё ходит по цепи кругом;
Идёт направо — песнь заводит,
Налево — сказку говорит.
Там чудеса: там леший бродит,
Русалка на ветвях сидит;
Там на неведомых дорожках
Следы невиданных зверей;
Избушка там на курьих ножках
Стоит без окон, без дверей;
Там лес и дол видений полны;
Там о заре прихлынут волны
На брег песчаный и пустой,
И тридцать витязей прекрасных
Чредой из вод выходят ясных,
И с ними дядька их морской;
Там королевич мимоходом
Пленяет грозного царя;
Там в облаках перед народом
Через леса, через моря
Колдун несёт богатыря;
В темнице там царевна тужит,
А бурый волк ей верно служит;
Там ступа с Бабою Ягой
Идёт, бредёт сама собой,
Там царь Кащей над златом чахнет;
Там русский дух… там Русью пахнет!
И там я был, и мёд я пил;
У моря видел дуб зелёный;
Под ним сидел, и кот учёный
Свои мне сказки говорил.
"""

# TODO Распечатайте в столбик букву и её частоту в тексте
let = count_letters(main_str)
calculate_frequency(let)